import 'package:places/domain/sight.dart';

final List mocks = <Sight>[
  const Sight(
    name: 'Египетские пирамиды',
    lat: 29.9751336,
    lon: 31.1344741,
    url:
        'https://wikiway.com/upload/hl-photo/83c/b85/egipetskie-piramidy_89.jpg',
    details: '''
Египетские пирамиды, расположенные недалеко от города Каир, где плодородная долина Нила граничит с раскаленными песками Ливийской пустыни, представляют собой величайшие архитектурные памятники античности. Эти гигантские каменные строения не перестают удивлять своей внушающей благоговение монументальностью. Имеющие правильную пирамидальную форму, они служили гробницами для могущественных фараонов Древнего Египта.''',
    type: 'Сооружение',
  ),
  const Sight(
    name: 'Мертвое море',
    lat: 31.5371797,
    lon: 35.4902884,
    url: 'https://wikiway.com/upload/hl-photo/a2d/c96/mertvoe-more_132.jpg',
    details: '''
Мертвое море — это уникальный подарок природы, который помогает людям оздоровиться и обрести долгие годы жизни, поэтому лечебные туры на Мертвом море пользуются особым спросом у туристов со всего мира. Исцеляющий водоем расположен на самой низшей точке земного шара. Соль, полезные минералы, кислород и чистая вода благоприятно способствуют на человеческий организм и способны избавить от многих заболеваний. В составе воды также есть грязь, которую в медицине используют для создания кремов и масок по уходу за кожей. Лечение грязью помогает укрепить иммунитет, снять стресс, избавиться от боли в суставах и прогреть организм полностью. Стоит заметить, что вода Мертвого моря обладает высокой концентрацией соли, отчего практически невозможно утонуть, а средняя круглогодичная температура воды не менее 24 градусов Цельсия. Такие условия позволяют приезжать за оздоровлением в любое время года.''',
    type: 'Море',
  ),
  const Sight(
    name: 'Тибет',
    lat: 31.669,
    lon: 88.755,
    url: 'https://wikiway.com/upload/hl-photo/6a8/6e1/tibet_214.jpg',
    details: '''
Тибет – горный регион Центральной Азии, расположенный в юго-западной части Китая и занимающий восьмую часть площади этого государства. Формально Тибетом считается автономный район со столицей Лхаса. В культурно-географическом отношении он гораздо больше и охватывает все Цинхай-Тибетское нагорье, хотя оно не везде имеет четкие границы; кроме того, тибетцы населяют также Западную Сычуань, Южную Ганьсу и Северную Юньнань. В этническом, языковом и религиозном отношении население Тибета принципиально отличается от жителей других китайских территорий.''',
    type: 'Горы',
  ),
  const Sight(
    name: 'Озеро Байкал',
    lat: 53.7286,
    lon: 108.5094,
    url: 'https://wikiway.com/upload/hl-photo/157/e31/ozero_baikal_207.jpg',
    details: '''
Озеро Байкал, расположенное на юге Восточной Сибири, на границе Иркутской области и Республики Бурятия, относится к числу самых древних водоемов нашей планеты. Но больше всего оно известно тем, что является самым глубоким озером на Земле и одновременно крупнейшим естественным резервуаром пресной воды – 19% всех мировых запасов.

И сам Байкал, и прибрежные территории отличает неповторимая в своем разнообразии флора и фауна, что делает эти места поистине уникальными, неизменно привлекающими к себе внимание научных умов и многочисленных любителей путешествий и настоящих искателей приключений.''',
    type: 'Озерo',
  ),
];
